function yy=lagrange(x,y,xx)
% вычисление интерпол€ционного полинома в форме Ћагранжа
% x - массив координат узлов
% y - массив значений интерполируемой функции
% xx - массив значений аргумента, дл€ которых надо вычислить значени€ полинома
% yy - массив значений полинома в точках xx 

% узнаем число узлов интерпол€ции (N=n+1)
N=length(x);
% создаем нулевой массив значений интерпол€ционного полинома
yy=zeros(size(xx));
% в цикле считаем сумму по узлам
for k=1:N
    % вычисл€ем произведени€, т.е. функции Psi_k
    t=ones(size(xx));
    for j=[1:k-1, k+1:N]
        t=t.*(xx-x(j))/(x(k)-x(j));
    end
    % накапливаем сумму
    yy = yy + y(k)*t;
end